IOsetting/FwLib_STC8/include/fw_reg_stc8g.h
#ifndef __FW_REG_STC8G_H__
#define __FW_REG_STC8G_H__

#include "fw_reg_base.h"

#define  _CCON          0xD8
SFR(CCON,               _CCON);
SBIT(CF,                _CCON, 7);
SBIT(CR,                _CCON, 6);
SBIT(CCF2,              _CCON, 2);
SBIT(CCF1,              _CCON, 1);
SBIT(CCF0,              _CCON, 0);
SFR(CMOD,               0xD9);
SFR(CCAPM0,             0xDA);
SFR(CCAPM1,             0xDB);
SFR(CCAPM2,             0xDC);
SFR(ADCCFG,             0xDE);
SFR(IP3,                0xDF);
SFR(ACC,                0xE0);
SFR(P7M1,               0xE1);
SFR(P7M0,               0xE2);
SFR(DPS,                0xE3);
SFR(DPL1,               0xE4);
SFR(DPH1,               0xE5);
SFR(CMPCR1,             0xE6);
SFR(CMPCR2,             0xE7);
SFR(P6,                 0xE8);
SFR(CL,                 0xE9);
SFR(CCAP0L,             0xEA);
SFR(CCAP1L,             0xEB);
SFR(CCAP2L,             0xEC);
SFR(IP3H,               0xEE);
SFR(AUXINTIF,           0xEF);

SFR(B,                  0xF0);
SFR(PWMSET,             0xF1);
SFR(PCA_PWM0,           0xF2);
SFR(PCA_PWM1,           0xF3);
SFR(PCA_PWM2,           0xF4);
SFR(IAP_TPS,            0xF5);
SFR(PWMCFG01,           0xF6);
SFR(PWMCFG23,           0xF7);
SFR(P7,                 0xF8);
SFR(CH,                 0xF9);
SFR(CCAP0H,             0xFA);
SFR(CCAP1H,             0xFB);
SFR(CCAP2H,             0xFC);
SFR(PWMCFG45,           0xFE);
SFR(RSTCFG,             0xFF);

//如下特殊功能寄存器位于扩展RAM区域
//访问这些寄存器,需先将P_SW2的BIT7设置为1,才可正常读写

/////////////////////////////////////////////////
//FF00H-FFFFH
/////////////////////////////////////////////////

#define     PWM0C       (*(unsigned int  volatile __XDATA *)0xff00)
#define     PWM0CH      (*(unsigned char volatile __XDATA *)0xff00)
#define     PWM0CL      (*(unsigned char volatile __XDATA *)0xff01)
#define     PWM0CKS     (*(unsigned char volatile __XDATA *)0xff02)
#define     PWM0TADC    (*(unsigned int  volatile __XDATA *)0xff03)
#define     PWM0TADCH   (*(unsigned char volatile __XDATA *)0xff03)
#define     PWM0TADCL   (*(unsigned char volatile __XDATA *)0xff04)
#define     PWM0IF      (*(unsigned char volatile __XDATA *)0xff05)
#define     PWM0FDCR    (*(unsigned char volatile __XDATA *)0xff06)
#define     PWM00T1     (*(unsigned int  volatile __XDATA *)0xff10)
#define     PWM00T1L    (*(unsigned char volatile __XDATA *)0xff11)
#define     PWM00T2     (*(unsigned int  volatile __XDATA *)0xff12)
#define     PWM00T2H    (*(unsigned char volatile __XDATA *)0xff12)
#define     PWM00T2L    (*(unsigned char volatile __XDATA *)0xff13)
#define     PWM00CR     (*(unsigned char volatile __XDATA *)0xff14)
#define     PWM00HLD    (*(unsigned char volatile __XDATA *)0xff15)
#define     PWM01T1     (*(unsigned int  volatile __XDATA *)0xff18)
#define     PWM01T1H    (*(unsigned char volatile __XDATA *)0xff18)
#define     PWM01T1L    (*(unsigned char volatile __XDATA *)0xff19)
#define     PWM01T2     (*(unsigned int  volatile __XDATA *)0xff1a)
#define     PWM01T2H    (*(unsigned char volatile __XDATA *)0xff1a)
#define     PWM01T2L    (*(unsigned char volatile __XDATA *)0xff1b)
#define     PWM01CR     (*(unsigned char volatile __XDATA *)0xff1c)
#define     PWM01HLD    (*(unsigned char volatile __XDATA *)0xff1d)
#define     PWM02T1     (*(unsigned int  volatile __XDATA *)0xff20)
#define     PWM02T1H    (*(unsigned char volatile __XDATA *)0xff20)
#define     PWM02T1L    (*(unsigned char volatile __XDATA *)0xff21)
#define     PWM02T2     (*(unsigned int  volatile __XDATA *)0xff22)
#define     PWM02T2H    (*(unsigned char volatile __XDATA *)0xff22)
#define     PWM02T2L    (*(unsigned char volatile __XDATA *)0xff23)
#define     PWM02CR     (*(unsigned char volatile __XDATA *)0xff24)
#define     PWM02HLD    (*(unsigned char volatile __XDATA *)0xff25)
#define     PWM03T1     (*(unsigned int  volatile __XDATA *)0xff28)
#define     PWM03T1H    (*(unsigned char volatile __XDATA *)0xff28)
#define     PWM03T1L    (*(unsigned char volatile __XDATA *)0xff29)
#define     PWM03T2     (*(unsigned int  volatile __XDATA *)0xff2a)
#define     PWM03T2H    (*(unsigned char volatile __XDATA *)0xff2a)
#define     PWM03T2L    (*(unsigned char volatile __XDATA *)0xff2b)
#define     PWM03CR     (*(unsigned char volatile __XDATA *)0xff2c)
#define     PWM03HLD    (*(unsigned char volatile __XDATA *)0xff2d)
#define     PWM04T1     (*(unsigned int  volatile __XDATA *)0xff30)
#define     PWM04T1H    (*(unsigned char volatile __XDATA *)0xff30)
#define     PWM04T1L    (*(unsigned char volatile __XDATA *)0xff31)
#define     PWM04T2     (*(unsigned int  volatile __XDATA *)0xff32)
#define     PWM04T2H    (*(unsigned char volatile __XDATA *)0xff32)
#define     PWM04T2L    (*(unsigned char volatile __XDATA *)0xff33)
#define     PWM04CR     (*(unsigned char volatile __XDATA *)0xff34)
#define     PWM04HLD    (*(unsigned char volatile __XDATA *)0xff35)
#define     PWM05T1     (*(unsigned int  volatile __XDATA *)0xff38)
#define     PWM05T1H    (*(unsigned char volatile __XDATA *)0xff38)
#define     PWM05T1L    (*(unsigned char volatile __XDATA *)0xff39)
#define     PWM05T2     (*(unsigned int  volatile __XDATA *)0xff3a)
#define     PWM05T2H    (*(unsigned char volatile __XDATA *)0xff3a)
#define     PWM05T2L    (*(unsigned char volatile __XDATA *)0xff3b)
#define     PWM05CR     (*(unsigned char volatile __XDATA *)0xff3c)
#define     PWM05HLD    (*(unsigned char volatile __XDATA *)0xff3d)
#define     PWM06T1     (*(unsigned int  volatile __XDATA *)0xff40)
#define     PWM06T1H    (*(unsigned char volatile __XDATA *)0xff40)
#define     PWM06T1L    (*(unsigned char volatile __XDATA *)0xff41)
#define     PWM06T2     (*(unsigned int  volatile __XDATA *)0xff42)
#define     PWM06T2H    (*(unsigned char volatile __XDATA *)0xff42)
#define     PWM06T2L    (*(unsigned char volatile __XDATA *)0xff43)
#define     PWM06CR     (*(unsigned char volatile __XDATA *)0xff44)
#define     PWM06HLD    (*(unsigned char volatile __XDATA *)0xff45)
#define     PWM07T1     (*(unsigned int  volatile __XDATA *)0xff48)
#define     PWM07T1H    (*(unsigned char volatile __XDATA *)0xff48)
#define     PWM07T1L    (*(unsigned char volatile __XDATA *)0xff49)
#define     PWM07T2     (*(unsigned int  volatile __XDATA *)0xff4a)
#define     PWM07T2H    (*(unsigned char volatile __XDATA *)0xff4a)
#define     PWM07T2L    (*(unsigned char volatile __XDATA *)0xff4b)
#define     PWM07CR     (*(unsigned char volatile __XDATA *)0xff4c)
#define     PWM07HLD    (*(unsigned char volatile __XDATA *)0xff4d)
#define     PWM1C       (*(unsigned int  volatile __XDATA *)0xff50)
#define     PWM1CH      (*(unsigned char volatile __XDATA *)0xff50)
#define     PWM1CL      (*(unsigned char volatile __XDATA *)0xff51)
#define     PWM1CKS     (*(unsigned char volatile __XDATA *)0xff52)
#define     PWM1IF      (*(unsigned char volatile __XDATA *)0xff55)
#define     PWM1FDCR    (*(unsigned char volatile __XDATA *)0xff56)
#define     PWM10T1     (*(unsigned int  volatile __XDATA *)0xff60)
#define     PWM10T1H    (*(unsigned char volatile __XDATA *)0xff60)
#define     PWM10T1L    (*(unsigned char volatile __XDATA *)0xff61)
#define     PWM10T2     (*(unsigned int  volatile __XDATA *)0xff62)
#define     PWM10T2H    (*(unsigned char volatile __XDATA *)0xff62)
#define     PWM10T2L    (*(unsigned char volatile __XDATA *)0xff63)
#define     PWM10CR     (*(unsigned char volatile __XDATA *)0xff64)
#define     PWM10HLD    (*(unsigned char volatile __XDATA *)0xff65)
#define     PWM11T1     (*(unsigned int  volatile __XDATA *)0xff68)
#define     PWM11T1H    (*(unsigned char volatile __XDATA *)0xff68)
#define     PWM11T1L    (*(unsigned char volatile __XDATA *)0xff69)
#define     PWM11T2     (*(unsigned int  volatile __XDATA *)0xff6a)
#define     PWM11T2H    (*(unsigned char volatile __XDATA *)0xff6a)
#define     PWM11T2L    (*(unsigned char volatile __XDATA *)0xff6b)
#define     PWM11CR     (*(unsigned char volatile __XDATA *)0xff6c)
#define     PWM11HLD    (*(unsigned char volatile __XDATA *)0xff6d)
#define     PWM12T1     (*(unsigned int  volatile __XDATA *)0xff70)
#define     PWM12T1H    (*(unsigned char volatile __XDATA *)0xff70)
#define     PWM12T1L    (*(unsigned char volatile __XDATA *)0xff71)
#define     PWM12T2     (*(unsigned int  volatile __XDATA *)0xff72)
#define     PWM12T2H    (*(unsigned char volatile __XDATA *)0xff72)
#define     PWM12T2L    (*(unsigned char volatile __XDATA *)0xff73)
#define     PWM12CR     (*(unsigned char volatile __XDATA *)0xff74)
#define     PWM12HLD    (*(unsigned char volatile __XDATA *)0xff75)
#define     PWM13T1     (*(unsigned int  volatile __XDATA *)0xff78)
#define     PWM13T1H    (*(unsigned char volatile __XDATA *)0xff78)
#define     PWM13T1L    (*(unsigned char volatile __XDATA *)0xff79)
#define     PWM13T2     (*(unsigned int  volatile __XDATA *)0xff7a)
#define     PWM13T2H    (*(unsigned char volatile __XDATA *)0xff7a)
#define     PWM13T2L    (*(unsigned char volatile __XDATA *)0xff7b)
#define     PWM13CR     (*(unsigned char volatile __XDATA *)0xff7c)
#define     PWM13HLD    (*(unsigned char volatile __XDATA *)0xff7d)
#define     PWM14T1     (*(unsigned int  volatile __XDATA *)0xff80)
#define     PWM14T1H    (*(unsigned char volatile __XDATA *)0xff80)
#define     PWM14T1L    (*(unsigned char volatile __XDATA *)0xff81)
#define     PWM14T2     (*(unsigned int  volatile __XDATA *)0xff82)
#define     PWM14T2H    (*(unsigned char volatile __XDATA *)0xff82)
#define     PWM14T2L    (*(unsigned char volatile __XDATA *)0xff83)
#define     PWM14CR     (*(unsigned char volatile __XDATA *)0xff84)
#define     PWM14HLD    (*(unsigned char volatile __XDATA *)0xff85)
#define     PWM15T1     (*(unsigned int  volatile __XDATA *)0xff88)
#define     PWM15T1H    (*(unsigned char volatile __XDATA *)0xff88)
#define     PWM15T1L    (*(unsigned char volatile __XDATA *)0xff89)
#define     PWM15T2     (*(unsigned int  volatile __XDATA *)0xff8a)
#define     PWM15T2H    (*(unsigned char volatile __XDATA *)0xff8a)
#define     PWM15T2L    (*(unsigned char volatile __XDATA *)0xff8b)
#define     PWM15CR     (*(unsigned char volatile __XDATA *)0xff8c)
#define     PWM15HLD    (*(unsigned char volatile __XDATA *)0xff8d)
#define     PWM16T1     (*(unsigned int  volatile __XDATA *)0xff90)
#define     PWM16T1H    (*(unsigned char volatile __XDATA *)0xff90)
#define     PWM16T1L    (*(unsigned char volatile __XDATA *)0xff91)
#define     PWM16T2     (*(unsigned int  volatile __XDATA *)0xff92)
#define     PWM16T2H    (*(unsigned char volatile __XDATA *)0xff92)
#define     PWM16T2L    (*(unsigned char volatile __XDATA *)0xff93)
#define     PWM16CR     (*(unsigned char volatile __XDATA *)0xff94)
#define     PWM16HLD    (*(unsigned char volatile __XDATA *)0xff95)
#define     PWM17T1     (*(unsigned int  volatile __XDATA *)0xff98)
#define     PWM17T1H    (*(unsigned char volatile __XDATA *)0xff98)
#define     PWM17T1L    (*(unsigned char volatile __XDATA *)0xff99)
#define     PWM17T2     (*(unsigned int  volatile __XDATA *)0xff9a)
#define     PWM17T2H    (*(unsigned char volatile __XDATA *)0xff9a)
#define     PWM17T2L    (*(unsigned char volatile __XDATA *)0xff9b)
#define     PWM17CR     (*(unsigned char volatile __XDATA *)0xff9c)
#define     PWM17HLD    (*(unsigned char volatile __XDATA *)0xff9d)
#define     PWM2C       (*(unsigned int  volatile __XDATA *)0xffa0)
#define     PWM2CH      (*(unsigned char volatile __XDATA *)0xffa0)
#define     PWM2CL      (*(unsigned char volatile __XDATA *)0xffa1)
#define     PWM2CKS     (*(unsigned char volatile __XDATA *)0xffa2)
#define     PWM2TADC    (*(unsigned int  volatile __XDATA *)0xffa3)
#define     PWM2TADCH   (*(unsigned char volatile __XDATA *)0xffa3)
#define     PWM2TADCL   (*(unsigned char volatile __XDATA *)0xffa4)
#define     PWM2IF      (*(unsigned char volatile __XDATA *)0xffa5)
#define     PWM2FDCR    (*(unsigned char volatile __XDATA *)0xffa6)
#define     PWM20T1     (*(unsigned int  volatile __XDATA *)0xffb0)
#define     PWM20T1H    (*(unsigned char volatile __XDATA *)0xffb0)
#define     PWM20T1L    (*(unsigned char volatile __XDATA *)0xffb1)
#define     PWM20T2     (*(unsigned int  volatile __XDATA *)0xffb2)
#define     PWM20T2H    (*(unsigned char volatile __XDATA *)0xffb2)
#define     PWM20T2L    (*(unsigned char volatile __XDATA *)0xffb3)
#define     PWM20CR     (*(unsigned char volatile __XDATA *)0xffb4)
#define     PWM20HLD    (*(unsigned char volatile __XDATA *)0xffb5)
#define     PWM21T1     (*(unsigned int  volatile __XDATA *)0xffb8)
#define     PWM21T1H    (*(unsigned char volatile __XDATA *)0xffb8)
#define     PWM21T1L    (*(unsigned char volatile __XDATA *)0xffb9)
#define     PWM21T2     (*(unsigned int  volatile __XDATA *)0xffba)
#define     PWM21T2H    (*(unsigned char volatile __XDATA *)0xffba)
#define     PWM21T2L    (*(unsigned char volatile __XDATA *)0xffbb)
#define     PWM21CR     (*(unsigned char volatile __XDATA *)0xffbc)
#define     PWM21HLD    (*(unsigned char volatile __XDATA *)0xffbd)
#define     PWM22T1     (*(unsigned int  volatile __XDATA *)0xffc0)
#define     PWM22T1H    (*(unsigned char volatile __XDATA *)0xffc0)
#define     PWM22T1L    (*(unsigned char volatile __XDATA *)0xffc1)
#define     PWM22T2     (*(unsigned int  volatile __XDATA *)0xffc2)
#define     PWM22T2H    (*(unsigned char volatile __XDATA *)0xffc2)
#define     PWM22T2L    (*(unsigned char volatile __XDATA *)0xffc3)
#define     PWM22CR     (*(unsigned char volatile __XDATA *)0xffc4)
#define     PWM22HLD    (*(unsigned char volatile __XDATA *)0xffc5)
#define     PWM23T1     (*(unsigned int  volatile __XDATA *)0xffc8)
#define     PWM23T1H    (*(unsigned char volatile __XDATA *)0xffc8)
#define     PWM23T1L    (*(unsigned char volatile __XDATA *)0xffc9)
#define     PWM23T2     (*(unsigned int  volatile __XDATA *)0xffca)
#define     PWM23T2H    (*(unsigned char volatile __XDATA *)0xffca)
#define     PWM23T2L    (*(unsigned char volatile __XDATA *)0xffcb)
#define     PWM23CR     (*(unsigned char volatile __XDATA *)0xffcc)
#define     PWM23HLD    (*(unsigned char volatile __XDATA *)0xffcd)
#define     PWM24T1     (*(unsigned int  volatile __XDATA *)0xffd0)
#define     PWM24T1H    (*(unsigned char volatile __XDATA *)0xffd0)
#define     PWM24T1L    (*(unsigned char volatile __XDATA *)0xffd1)
#define     PWM24T2     (*(unsigned int  volatile __XDATA *)0xffd2)
#define     PWM24T2H    (*(unsigned char volatile __XDATA *)0xffd2)
#define     PWM24T2L    (*(unsigned char volatile __XDATA *)0xffd3)
#define     PWM24CR     (*(unsigned char volatile __XDATA *)0xffd4)
#define     PWM24HLD    (*(unsigned char volatile __XDATA *)0xffd5)
#define     PWM25T1     (*(unsigned int  volatile __XDATA *)0xffd8)
#define     PWM25T1H    (*(unsigned char volatile __XDATA *)0xffd8)
#define     PWM25T1L    (*(unsigned char volatile __XDATA *)0xffd9)
#define     PWM25T2     (*(unsigned int  volatile __XDATA *)0xffda)
#define     PWM25T2H    (*(unsigned char volatile __XDATA *)0xffda)
#define     PWM25T2L    (*(unsigned char volatile __XDATA *)0xffdb)
#define     PWM25CR     (*(unsigned char volatile __XDATA *)0xffdc)
#define     PWM25HLD    (*(unsigned char volatile __XDATA *)0xffdd)
#define     PWM26T1     (*(unsigned int  volatile __XDATA *)0xffe0)
#define     PWM26T1H    (*(unsigned char volatile __XDATA *)0xffe0)
#define     PWM26T1L    (*(unsigned char volatile __XDATA *)0xffe1)
#define     PWM26T2     (*(unsigned int  volatile __XDATA *)0xffe2)
#define     PWM26T2H    (*(unsigned char volatile __XDATA *)0xffe2)
#define     PWM26T2L    (*(unsigned char volatile __XDATA *)0xffe3)
#define     PWM26CR     (*(unsigned char volatile __XDATA *)0xffe4)
#define     PWM26HLD    (*(unsigned char volatile __XDATA *)0xffe5)
#define     PWM27T1     (*(unsigned int  volatile __XDATA *)0xffe8)
#define     PWM27T1H    (*(unsigned char volatile __XDATA *)0xffe8)
#define     PWM27T1L    (*(unsigned char volatile __XDATA *)0xffe9)
#define     PWM27T2     (*(unsigned int  volatile __XDATA *)0xffea)
#define     PWM27T2H    (*(unsigned char volatile __XDATA *)0xffea)
#define     PWM27T2L    (*(unsigned char volatile __XDATA *)0xffeb)
#define     PWM27CR     (*(unsigned char volatile __XDATA *)0xffec)
#define     PWM27HLD    (*(unsigned char volatile __XDATA *)0xffed)

/////////////////////////////////////////////////
//FE00H-FEFFH
/////////////////////////////////////////////////

#define     CKSEL       (*(unsigned char volatile __XDATA *)0xfe00)
#define     CLKDIV      (*(unsigned char volatile __XDATA *)0xfe01)
#define     HIRCCR      (*(unsigned char volatile __XDATA *)0xfe02)
#define     XOSCCR      (*(unsigned char volatile __XDATA *)0xfe03)
#define     IRC32KCR    (*(unsigned char volatile __XDATA *)0xfe04)
#define     MCLKOCR     (*(unsigned char volatile __XDATA *)0xfe05)
#define     IRCDB       (*(unsigned char volatile __XDATA *)0xfe06)
#define     X32KCR      (*(unsigned char volatile __XDATA *)0xfe08)
#define     PxPU                                            0xfe10
#define     P0PU        (*(unsigned char volatile __XDATA *)0xfe10)
#define     P1PU        (*(unsigned char volatile __XDATA *)0xfe11)
#define     P2PU        (*(unsigned char volatile __XDATA *)0xfe12)
#define     P3PU        (*(unsigned char volatile __XDATA *)0xfe13)
#define     P4PU        (*(unsigned char volatile __XDATA *)0xfe14)
#define     P5PU        (*(unsigned char volatile __XDATA *)0xfe15)
#define     P6PU        (*(unsigned char volatile __XDATA *)0xfe16)
#define     P7PU        (*(unsigned char volatile __XDATA *)0xfe17)
#define     PxNCS                                           0xfe18
#define     P0NCS       (*(unsigned char volatile __XDATA *)0xfe18)
#define     P1NCS       (*(unsigned char volatile __XDATA *)0xfe19)
#define     P2NCS       (*(unsigned char volatile __XDATA *)0xfe1a)
#define     P3NCS       (*(unsigned char volatile __XDATA *)0xfe1b)
#define     P4NCS       (*(unsigned char volatile __XDATA *)0xfe1c)
#define     P5NCS       (*(unsigned char volatile __XDATA *)0xfe1d)
#define     P6NCS       (*(unsigned char volatile __XDATA *)0xfe1e)
#define     P7NCS       (*(unsigned char volatile __XDATA *)0xfe1f)
#define     PxSR                                            0xfe20
#define     P0SR        (*(unsigned char volatile __XDATA *)0xfe20)
#define     P1SR        (*(unsigned char volatile __XDATA *)0xfe21)
#define     P2SR        (*(unsigned char volatile __XDATA *)0xfe22)
#define     P3SR        (*(unsigned char volatile __XDATA *)0xfe23)
#define     P4SR        (*(unsigned char volatile __XDATA *)0xfe24)
#define     P5SR        (*(unsigned char volatile __XDATA *)0xfe25)
#define     P6SR        (*(unsigned char volatile __XDATA *)0xfe26)
#define     P7SR        (*(unsigned char volatile __XDATA *)0xfe27)
#define     PxDR                                            0xfe28
#define     P0DR        (*(unsigned char volatile __XDATA *)0xfe28)
#define     P1DR        (*(unsigned char volatile __XDATA *)0xfe29)
#define     P2DR        (*(unsigned char volatile __XDATA *)0xfe2a)
#define     P3DR        (*(unsigned char volatile __XDATA *)0xfe2b)
#define     P4DR        (*(unsigned char volatile __XDATA *)0xfe2c)
#define     P5DR        (*(unsigned char volatile __XDATA *)0xfe2d)
#define     P6DR        (*(unsigned char volatile __XDATA *)0xfe2e)
#define     P7DR        (*(unsigned char volatile __XDATA *)0xfe2f)
#define     PxIE                                            0xfe30
#define     P0IE        (*(unsigned char volatile __XDATA *)0xfe30)
#define     P1IE        (*(unsigned char volatile __XDATA *)0xfe31)
#define     P2IE        (*(unsigned char volatile __XDATA *)0xfe32)
#define     P3IE        (*(unsigned char volatile __XDATA *)0xfe33)
#define     P4IE        (*(unsigned char volatile __XDATA *)0xfe34)
#define     P5IE        (*(unsigned char volatile __XDATA *)0xfe35)
#define     P6IE        (*(unsigned char volatile __XDATA *)0xfe36)
#define     P7IE        (*(unsigned char volatile __XDATA *)0xfe37)

